# A191 Stock Factors 081-100

In [1]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [2]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 081

Formula:

`SMA(VOLUME,21,2)`

In [5]:
sql_alpha_081 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(volume,21,2) 
    AS alpha_a191_f0081
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_081), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0081
5067    2023-01-04  000001.SZ      2.189683e+08
5068    2023-01-04  000002.SZ      1.087147e+08
5069    2023-01-04  000004.SZ      1.637562e+06
5070    2023-01-04  000005.SZ      4.557470e+06
5071    2023-01-04  000006.SZ      1.375250e+08
...            ...        ...               ...
3858343 2025-12-26  688805.SH      1.383262e+07
3858344 2025-12-26  688807.SH      6.965864e+06
3858345 2025-12-26  688819.SH      2.940819e+06
3858346 2025-12-26  688981.SH      4.475856e+07
3858347 2025-12-26  689009.SH      6.225828e+06

[3668803 rows x 3 columns]

## A191 Factor 082

Formula:

`SMA((TSMAX(HIGH,6)-CLOSE)/(TSMAX(HIGH,6)-TSMIN(LOW,6))*100,20,1)`

In [6]:
sql_alpha_082 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm((m_max(high,6)-close)/(m_max(high,6)-m_min(low,6))*100,20,1) 
    AS alpha_a191_f0082
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_082), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0082
30405   2023-01-11  000001.SZ         17.460317
30406   2023-01-11  000002.SZ         43.209877
30407   2023-01-11  000004.SZ         98.591549
30408   2023-01-11  000005.SZ         92.307692
30409   2023-01-11  000006.SZ         88.372093
...            ...        ...               ...
3858341 2025-12-26  688800.SH         49.154228
3858342 2025-12-26  688802.SH         83.547502
3858345 2025-12-26  688819.SH         49.876124
3858346 2025-12-26  688981.SH         46.363713
3858347 2025-12-26  689009.SH         50.194503

[3642292 rows x 3 columns]

## A191 Factor 083

Formula:

`(-1 * RANK(COVIANCE(RANK(HIGH), RANK(VOLUME), 5)))`

In [7]:
sql_alpha_083 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * c_pct_rank(m_covar_samp(c_pct_rank(high), c_pct_rank(volume), 5))) 
    AS alpha_a191_f0083
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_083), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0083
25337   2023-01-10  000001.SZ         -0.170991
25338   2023-01-10  000002.SZ         -0.185495
25339   2023-01-10  000004.SZ         -0.723391
25340   2023-01-10  000005.SZ         -0.820838
25341   2023-01-10  000006.SZ         -0.389173
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.309496
3858344 2025-12-26  688807.SH         -0.700969
3858345 2025-12-26  688819.SH         -0.311240
3858346 2025-12-26  688981.SH         -0.244961
3858347 2025-12-26  689009.SH         -0.011822

[3647592 rows x 3 columns]

## A191 Factor 084

Formula:

`SUM((CLOSE>DELAY(CLOSE,1)?VOLUME:(CLOSE<DELAY(CLOSE,1)?-VOLUME:0)),20)`

In [8]:
sql_alpha_084 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close>m_lag(close,1),volume,IF(close<m_lag(close,1),-volume,0)),20) 
    AS alpha_a191_f0084
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_084), filters={'date': [sd, ed]}).df().dropna()

              date instrument alpha_a191_f0084
101438  2023-02-07  000001.SZ        115637699
101439  2023-02-07  000002.SZ       -205540467
101440  2023-02-07  000004.SZ          6987972
101441  2023-02-07  000005.SZ        -41059288
101442  2023-02-07  000006.SZ       -453832875
...            ...        ...              ...
3858340 2025-12-26  688799.SH          2983058
3858341 2025-12-26  688800.SH         48889635
3858345 2025-12-26  688819.SH          9024921
3858346 2025-12-26  688981.SH        -29962378
3858347 2025-12-26  689009.SH         11276733

[3568164 rows x 3 columns]

## A191 Factor 085

Formula:

`(TSRANK((VOLUME / MEAN(VOLUME,20)), 20) * TSRANK((-1 * DELTA(CLOSE, 7)), 8))`

In [9]:
sql_alpha_085 = f"""--sql
SELECT
    date,
    instrument,
    (m_rank((volume / m_avg(volume,20)), 20) * m_rank((-1 * m_delta(close, 7)), 8)) 
    AS alpha_a191_f0085
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_085), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0085
198203  2023-03-06  000001.SZ             144.0
198204  2023-03-06  000002.SZ             152.0
198205  2023-03-06  000004.SZ              72.0
198206  2023-03-06  000005.SZ              31.5
198207  2023-03-06  000006.SZ              56.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH              90.0
3858341 2025-12-26  688800.SH              30.0
3858345 2025-12-26  688819.SH              95.0
3858346 2025-12-26  688981.SH              42.0
3858347 2025-12-26  689009.SH             120.0

[3467725 rows x 3 columns]

## A191 Factor 086

Formula:

`((0.25 < (((DELAY(CLOSE, 20) -DELAY(CLOSE, 10)) / 10) -((DELAY(CLOSE, 10) -CLOSE) / 10))) ? (-1 * 1):(((((DELAY(CLOSE, 20) -DELAY(CLOSE, 10)) / 10) -((DELAY(CLOSE, 10) -CLOSE) / 10)) < 0) ? 1 : ((-1 * 1) *(CLOSE -DELAY(CLOSE, 1)))))`

In [10]:
sql_alpha_086 = f"""--sql
SELECT
    date,
    instrument,
    (IF((0.25 < (((m_lag(close, 20) - m_lag(close, 10)) / 10) - ((m_lag(close, 10) - close) / 10))),
        (-1 * 1),
        (IF((((m_lag(close, 20) - m_lag(close, 10)) / 10) - ((m_lag(close, 10) - close) / 10)) < 0,
            1,
            ((-1 * 1) * (close - m_lag(close, 1))))))) 
    AS alpha_a191_f0086
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_086), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0086
10134   2023-01-05  000001.SZ        -18.229794
10135   2023-01-05  000002.SZ        -44.934245
10136   2023-01-05  000004.SZ          0.447025
10137   2023-01-05  000005.SZ         -0.370704
10138   2023-01-05  000006.SZ          9.345492
...            ...        ...               ...
3858343 2025-12-26  688805.SH          2.460000
3858344 2025-12-26  688807.SH         18.900000
3858345 2025-12-26  688819.SH          1.000000
3858346 2025-12-26  688981.SH          0.980000
3858347 2025-12-26  689009.SH          1.000000

[3663499 rows x 3 columns]

## A191 Factor 087

Formula:

`((RANK(DECAYLINEAR(DELTA(VWAP, 4), 7)) + TSRANK(DECAYLINEAR(((((LOW * 0.9) + (LOW * 0.1)) -VWAP) /(OPEN -((HIGH + LOW) / 2))), 11), 7)) * -1)`

In [11]:
sql_alpha_087 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank(m_decay_linear(m_delta(vwap, 4), 7)) +
      m_pct_rank(m_decay_linear(((((low * 0.9) + (low * 0.1)) -vwap) /(open -((high + low) / 2))), 11), 7)) * -1) 
    AS alpha_a191_f0087
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_087), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0087
55766   2023-01-18  000021.SZ         -0.611147
55789   2023-01-18  000055.SZ         -0.527677
55807   2023-01-18  000099.SZ         -0.479805
60837   2023-01-19  000021.SZ         -0.790318
60860   2023-01-19  000055.SZ         -0.504019
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -1.616258
3858341 2025-12-26  688800.SH         -1.548349
3858345 2025-12-26  688819.SH         -1.537044
3858346 2025-12-26  688981.SH         -1.983708
3858347 2025-12-26  689009.SH         -1.373019

[2893058 rows x 3 columns]

## A191 Factor 088

Formula:

`(CLOSE-DELAY(CLOSE,20))/DELAY(CLOSE,20)*100`

In [12]:
sql_alpha_088 = f"""--sql
SELECT
    date,
    instrument,
    (close-m_lag(close,20))/m_lag(close,20)*100 
    AS alpha_a191_f0088
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_088), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0088
106518  2023-02-08  000001.SZ         -1.955307
106519  2023-02-08  000002.SZ         -8.232826
106520  2023-02-08  000004.SZ          3.413655
106521  2023-02-08  000005.SZ         -2.673797
106522  2023-02-08  000006.SZ        -11.201299
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.930329
3858341 2025-12-26  688800.SH         25.697674
3858345 2025-12-26  688819.SH          5.917160
3858346 2025-12-26  688981.SH          7.482394
3858347 2025-12-26  689009.SH         -0.070286

[3562874 rows x 3 columns]

## A191 Factor 089

Formula:

`2*(SMA(CLOSE,13,2)-SMA(CLOSE,27,2)-SMA(SMA(CLOSE,13,2)-SMA(CLOSE,27,2),10,2))`

In [13]:
sql_alpha_089 = f"""--sql
SELECT
    date,
    instrument,
    2*(m_ta_ewm(close,13,2)-m_ta_ewm(close,27,2)-m_ta_ewm(m_ta_ewm(close,13,2)-m_ta_ewm(close,27,2),10,2)) 
    AS alpha_a191_f0089
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_089), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0089
5067    2023-01-04  000001.SZ          0.000000
5068    2023-01-04  000002.SZ          0.000000
5069    2023-01-04  000004.SZ          0.000000
5070    2023-01-04  000005.SZ          0.000000
5071    2023-01-04  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH         -0.313983
3858344 2025-12-26  688807.SH         -1.547574
3858345 2025-12-26  688819.SH          0.230516
3858346 2025-12-26  688981.SH          2.624426
3858347 2025-12-26  689009.SH          0.293109

[3668803 rows x 3 columns]

## A191 Factor 090

Formula:

`( RANK(CORR(RANK(VWAP), RANK(VOLUME), 5)) * -1)`

In [14]:
sql_alpha_090 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(c_pct_rank(vwap), c_pct_rank(volume), 5)) * -1) 
    AS alpha_a191_f0090
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_090), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0090
25337   2023-01-10  000001.SZ         -0.033912
25338   2023-01-10  000002.SZ         -0.463534
25339   2023-01-10  000004.SZ         -0.395506
25340   2023-01-10  000005.SZ         -0.794893
25341   2023-01-10  000006.SZ         -0.834934
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.322093
3858344 2025-12-26  688807.SH         -0.522093
3858345 2025-12-26  688819.SH         -0.607558
3858346 2025-12-26  688981.SH         -0.544961
3858347 2025-12-26  689009.SH         -0.076938

[3647592 rows x 3 columns]

## A191 Factor 091

Formula:

`((RANK((CLOSE -MAX(CLOSE, 5)))*RANK(CORR((MEAN(VOLUME,40)), LOW, 5))) * -1)`

In [15]:
sql_alpha_091 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank((close - m_max(close, 5)))*c_pct_rank(m_corr((m_avg(volume,40)), low, 5))) * -1) 
    AS alpha_a191_f0091
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_091), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0091
223749  2023-03-13  000001.SZ         -0.001689
223750  2023-03-13  000002.SZ         -0.002439
223751  2023-03-13  000004.SZ         -0.499100
223752  2023-03-13  000005.SZ         -0.170195
223753  2023-03-13  000006.SZ         -0.029758
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.072616
3858341 2025-12-26  688800.SH         -0.085107
3858345 2025-12-26  688819.SH         -0.030799
3858346 2025-12-26  688981.SH         -0.035324
3858347 2025-12-26  689009.SH         -0.069920

[3441325 rows x 3 columns]

## A191 Factor 092

Formula:

`(MAX(RANK(DECAYLINEAR(DELTA(((CLOSE * 0.35) + (VWAP *0.65)), 2), 3)),TSRANK(DECAYLINEAR(ABS(CORR((MEAN(VOLUME,180)), CLOSE, 13)), 5), 15)) * -1)`

In [16]:
sql_alpha_092 = f"""--sql
SELECT
    date,
    instrument,
    (greatest(c_pct_rank(m_decay_linear(m_delta(((close * 0.35) + (vwap *0.65)), 2), 3)),
              m_rank(m_decay_linear(abs(m_corr((m_avg(volume,180)), close, 13)), 5), 15)) * -1) 
    AS alpha_a191_f0092
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_092), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0092
25337   2023-01-10  000001.SZ         -0.951175
25338   2023-01-10  000002.SZ         -0.001226
25339   2023-01-10  000004.SZ         -0.188560
25340   2023-01-10  000005.SZ         -0.345250
25341   2023-01-10  000006.SZ         -0.011032
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.001550
3858344 2025-12-26  688807.SH         -0.005426
3858345 2025-12-26  688819.SH         -8.000000
3858346 2025-12-26  688981.SH        -15.000000
3858347 2025-12-26  689009.SH         -3.000000

[3647592 rows x 3 columns]

## A191 Factor 093

Formula:

`SUM((OPEN>=DELAY(OPEN,1)?0:MAX((OPEN-LOW),(OPEN-DELAY(OPEN,1)))),20)`

In [17]:
sql_alpha_093 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(open>=m_lag(open,1),0,greatest((open-low),(open-m_lag(open,1)))),20) 
    AS alpha_a191_f0093
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_093), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0093
101438  2023-02-07  000001.SZ        242.684129
101439  2023-02-07  000002.SZ        494.276698
101440  2023-02-07  000004.SZ          4.551525
101441  2023-02-07  000005.SZ          1.112112
101442  2023-02-07  000006.SZ         46.727458
...            ...        ...               ...
3858340 2025-12-26  688799.SH         10.274073
3858341 2025-12-26  688800.SH         30.392244
3858345 2025-12-26  688819.SH          2.187045
3858346 2025-12-26  688981.SH          8.690000
3858347 2025-12-26  689009.SH          5.217921

[3568164 rows x 3 columns]

## A191 Factor 094

Formula:

`SUM((CLOSE>DELAY(CLOSE,1)?VOLUME:(CLOSE<DELAY(CLOSE,1)?-VOLUME:0)),30)`

In [18]:
sql_alpha_094 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close > m_lag(close, 1), volume, IF(close < m_lag(close, 1), -volume, 0)), 30) 
    AS alpha_a191_f0094
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_094), filters={'date': [sd, ed]}).df().dropna()

              date instrument alpha_a191_f0094
152305  2023-02-21  000001.SZ       -273060107
152306  2023-02-21  000002.SZ       -245996786
152307  2023-02-21  000004.SZ         -2192004
152308  2023-02-21  000005.SZ        -62460129
152309  2023-02-21  000006.SZ       -256168389
...            ...        ...              ...
3858340 2025-12-26  688799.SH          4427981
3858341 2025-12-26  688800.SH         64342384
3858345 2025-12-26  688819.SH         -7353142
3858346 2025-12-26  688981.SH        -20172484
3858347 2025-12-26  689009.SH          9631495

[3515281 rows x 3 columns]

## A191 Factor 095

Formula:

`STD(AMOUNT,20)`

In [19]:
sql_alpha_095 = f"""--sql
SELECT
    date,
    instrument,
    m_stddev(amount,20) 
    AS alpha_a191_f0095
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_095), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0095
101438  2023-02-07  000001.SZ      5.990590e+08
101439  2023-02-07  000002.SZ      4.298814e+08
101440  2023-02-07  000004.SZ      1.564401e+07
101441  2023-02-07  000005.SZ      7.543805e+06
101442  2023-02-07  000006.SZ      1.792990e+08
...            ...        ...               ...
3858340 2025-12-26  688799.SH      2.267543e+07
3858341 2025-12-26  688800.SH      5.479038e+08
3858345 2025-12-26  688819.SH      3.487409e+07
3858346 2025-12-26  688981.SH      1.780012e+09
3858347 2025-12-26  689009.SH      1.217612e+08

[3568164 rows x 3 columns]

## A191 Factor 096

Formula:

`SMA(SMA((CLOSE-TSMIN(LOW,9))/(TSMAX(HIGH,9)-TSMIN(LOW,9))*100,3,1),3,1)`

In [20]:
sql_alpha_096 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(m_ta_ewm((close-m_min(low,9))/(m_max(high,9)-m_min(low,9))*100,3,1),3,1) 
    AS alpha_a191_f0096
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_096), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0096
45612   2023-01-16  000001.SZ         87.878788
45613   2023-01-16  000002.SZ         38.888889
45614   2023-01-16  000004.SZ         41.333333
45615   2023-01-16  000005.SZ         23.076923
45616   2023-01-16  000006.SZ          1.904762
...            ...        ...               ...
3858340 2025-12-26  688799.SH         57.181497
3858341 2025-12-26  688800.SH         46.458363
3858345 2025-12-26  688819.SH         51.942672
3858346 2025-12-26  688981.SH         69.982728
3858347 2025-12-26  689009.SH         60.463623

[3626398 rows x 3 columns]

## A191 Factor 097

Formula:

`STD(VOLUME,10)`

In [21]:
sql_alpha_097 = f"""--sql
SELECT
    date,
    instrument,
    m_stddev(volume,10) 
    AS alpha_a191_f0097
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_097), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0097
50681   2023-01-17  000001.SZ      4.645279e+07
50682   2023-01-17  000002.SZ      1.818874e+07
50683   2023-01-17  000004.SZ      3.856157e+05
50684   2023-01-17  000005.SZ      3.305020e+06
50685   2023-01-17  000006.SZ      3.311221e+07
...            ...        ...               ...
3858340 2025-12-26  688799.SH      4.395064e+05
3858341 2025-12-26  688800.SH      4.649570e+06
3858345 2025-12-26  688819.SH      4.905269e+05
3858346 2025-12-26  688981.SH      1.677694e+07
3858347 2025-12-26  689009.SH      1.857539e+06

[3621102 rows x 3 columns]

## A191 Factor 098

Formula:

`((((DELTA((SUM(CLOSE, 100) / 100), 100) / DELAY(CLOSE, 100)) < 0.05) || ((DELTA((SUM(CLOSE, 100) / 100), 100) /DELAY(CLOSE, 100)) == 0.05)) ? (-1 * (CLOSE -TSMIN(CLOSE, 100))) : (-1 * DELTA(CLOSE, 3)))`

In [22]:
sql_alpha_098 = f"""--sql
SELECT
    date,
    instrument,
    (IF((((m_delta((m_sum(close, 100) / 100), 100) / m_lag(close, 100)) < 0.05) OR
         ((m_delta((m_sum(close, 100) / 100), 100) / m_lag(close, 100)) == 0.05)),
        (-1 * (close - m_min(close, 100))),
        (-1 * m_delta(close, 3)))) 
    AS alpha_a191_f0098
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_098), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0098
20269   2023-01-09  000001.SZ        -54.689381
20270   2023-01-09  000002.SZ         50.118966
20271   2023-01-09  000004.SZ          1.097243
20272   2023-01-09  000005.SZ         -0.092676
20273   2023-01-09  000006.SZ         17.912192
...            ...        ...               ...
3858342 2025-12-26  688802.SH         47.900000
3858344 2025-12-26  688807.SH          5.310000
3858345 2025-12-26  688819.SH         -1.268486
3858346 2025-12-26  688981.SH         -2.200000
3858347 2025-12-26  689009.SH         -2.913770

[3652892 rows x 3 columns]

## A191 Factor 099

Formula:

`(-1 * RANK(COVIANCE(RANK(CLOSE), RANK(VOLUME), 5)))`

In [3]:
sql_alpha_099 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * c_pct_rank(m_covar_samp(c_pct_rank(close), c_pct_rank(volume), 5))) 
    AS alpha_a191_f0099
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_099), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0099
25337   2023-01-10  000001.SZ         -0.220429
25338   2023-01-10  000002.SZ         -0.230235
25339   2023-01-10  000004.SZ         -0.618795
25340   2023-01-10  000005.SZ         -0.738100
25341   2023-01-10  000006.SZ         -0.397753
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.318023
3858344 2025-12-26  688807.SH         -0.820736
3858345 2025-12-26  688819.SH         -0.393992
3858346 2025-12-26  688981.SH         -0.401550
3858347 2025-12-26  689009.SH         -0.007364

[3647592 rows x 3 columns]

## A191 Factor 100

Formula:

`STD(VOLUME,20)`

In [4]:
sql_alpha_100 = f"""--sql
SELECT
    date,
    instrument,
    m_stddev(volume,20)  
    AS alpha_a191_f0100
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_100), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0100
101438  2023-02-07  000001.SZ      4.200577e+07
101439  2023-02-07  000002.SZ      2.434837e+07
101440  2023-02-07  000004.SZ      1.488091e+06
101441  2023-02-07  000005.SZ      4.095859e+06
101442  2023-02-07  000006.SZ      2.815223e+07
...            ...        ...               ...
3858340 2025-12-26  688799.SH      4.531326e+05
3858341 2025-12-26  688800.SH      5.967602e+06
3858345 2025-12-26  688819.SH      1.043390e+06
3858346 2025-12-26  688981.SH      1.432633e+07
3858347 2025-12-26  689009.SH      2.074953e+06

[3568164 rows x 3 columns]